.doom.d/config.org
#+title: Samb's Doom Emacs Config
#+author: Samb

/多花时间编程，少花时间折腾/

* 基础行为 & 变量
** 你的名字
#+begin_src emacs-lisp
  (setq user-full-name "Jie Samb"
        user-mail-address "samb233@hotmail.com")
#+end_src

** 文件编码
将文件编码全部设定为utf-8-unix
#+begin_src emacs-lisp
  (setq-default buffer-file-coding-system 'utf-8-unix)
  (set-default-coding-systems 'utf-8-unix)
  (prefer-coding-system 'utf-8-unix)
#+end_src

** 窗口大小 & 名称
设置窗口的大小。
我喜欢用较小的窗口记笔记，所以设置的80列50行。写代码是最大化窗口即可。
#+begin_src emacs-lisp
  (pushnew! default-frame-alist '(width . 80) '(height . 50))
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

设置窗口透明度。
设置alpha是调用系统窗口混合器来实现半透明，文字和图片也会半透明化
而alpha-background是emacs29新引入的特性，只半透明背景，不会半透明文字和图片。
#+begin_src emacs-lisp
  ;; (add-to-list 'default-frame-alist '(alpha-background . 95))
  ;; (add-to-list 'default-frame-alist (cons 'alpha 90))
#+end_src

设置标题栏名称。
我将其设置为文件路径。
#+begin_src emacs-lisp
  (setq frame-title-format
        '((:eval (if (buffer-file-name)
                     (concat (format "emacs@%s: " (system-name))
                             (abbreviate-file-name (buffer-file-name))
                             (if (buffer-modified-p) "*"))
                   (format "emacs@%s" (system-name))))))
#+end_src

让doom在启动时不再显示加载了多少包
这能使我更专注与使用而不是折腾插件
#+begin_src emacs-lisp
  (remove-hook! 'doom-after-init-hook #'doom-display-benchmark-h)
#+end_src

** auth-save
不让emacs保存auth信息
#+begin_src emacs-lisp
  (setq auth-source-save-behavior nil)
#+end_src

** buffer-name
设置buffer name重复时的处理。
在前面添加路径
#+begin_src emacs-lisp
  (setq uniquify-buffer-name-style 'forward)
#+end_src

** native-comp
关闭native-comp
#+begin_src emacs-lisp
  (setq native-comp-speed -1)
  (setq native-comp-jit-compilation nil)
#+end_src

* 外观
** 字体
设置字体与字体大小。
使用after-setting-font-hook来设置中文字体
#+begin_src emacs-lisp
  (setq doom-font (font-spec :family "BlexMono Nerd Font" :weight 'medium :size 11.0))
  (setq doom-unicode-font (font-spec :family "BlexMono Nerd Font"))
  (setq doom-variable-pitch-font (font-spec :family "霞鹜文楷"))

  (defun my-cjk-font()
    (set-fontset-font t 'unicode (font-spec :family "Noto Color Emoji") nil 'prepend)
    (dolist (charset '(kana han cjk-misc symbol bopomofo))
      (set-fontset-font t charset (font-spec :family "Sarasa Mono SC") nil)
      (set-fontset-font t charset (font-spec :family "霞鹜文楷") nil 'append)))

  (add-hook 'after-setting-font-hook #'my-cjk-font)
#+end_src

** 主题
#+begin_src emacs-lisp
  (setq doom-theme 'doom-tomorrow-day)
#+end_src

** 行号
更改行号的字重，不然在不高的分辨率下会有锯齿
#+begin_src emacs-lisp
  ;; (custom-set-faces
  ;;  '(line-number ((t (:weight medium :slant unspecified))))
  ;;  '(line-number-current-line ((t (:weight medium :slant unspecified)))))
#+end_src

** icon
稍微小一点
#+begin_src emacs-lisp
  (setq all-the-icons-scale-factor 1.2)
#+end_src

** modeline
简洁一点，去掉doom-modeline的部分图标
#+begin_src emacs-lisp
  (after! doom-modeline
    (setq doom-modeline-modal nil
          doom-modeline-icon nil
          doom-modeline-lsp nil
          doom-modeline-buffer-state-icon nil
          doom-modeline-buffer-modification-icon nil
          doom-modeline-buffer-encoding t
          doom-modeline-vcs-max-length 20
          doom-modeline-height 29
          doom-modeline-window-width-limit 120)
    ;;(set-face-attribute 'mode-line-active nil :background "#f4f4f4")
    )

  (after! solaire-mode
   (dolist (face '(mode-line mode-line-inactive))
      (setf (alist-get face solaire-mode-remap-alist) nil)))
#+end_src

** word-wrap
#+begin_src emacs-lisp
  (setq word-wrap-by-category t)
#+end_src

* 按键
** 鼠标
滚轮
#+begin_src emacs-lisp
  (setq mouse-wheel-progressive-speed nil
        scroll-preserve-screen-position nil)
  (setq mouse-wheel-scroll-amount
        '(3
          ((shift) . hscroll)
          ((meta))
          ((control) . text-scale)))
#+end_src

emacs29新加入的像素滚动模式。
并且设置evil-move-beyond-eol，来让光标不乱跳，并解决图片偶尔卡住的bug
#+begin_src emacs-lisp
  ;; (pixel-scroll-precision-mode t)
#+end_src

侧键
#+begin_src emacs-lisp
  (map! :n "<mouse-8>" #'better-jumper-jump-backward
        :n "<mouse-9>" #'better-jumper-jump-forward)
#+end_src

** 键位设置
#+begin_src emacs-lisp
  (map! :i  "C-v"   #'yank
        :i  "M-v"   #'yank
        :v  "J"     #'drag-stuff-down
        :v  "K"     #'drag-stuff-up
        :ni "C-s"   #'consult-line
        :ni "C-z"   #'undo-only
        :ni "C-S-z" #'undo-redo
        :nv "g r"   #'+lookup/references
        :n  "q"     #'doom/escape
        :n  "U"     #'evil-redo
        :n  "g a"   #'avy-goto-char-2
        :n  "] e"   #'flymake-goto-next-error
        :n  "[ e"   #'flymake-goto-prev-error
        :n  "] w"   #'evil-window-right
        :n  "[ w"   #'evil-window-left
        :n  "[ W"   #'evil-window-down
        :n  "] W"   #'evil-window-up
        :leader
        :desc "jump to references" "c r" #'+lookup/references
        :desc "consult buffer" "<" #'consult-buffer
        :desc "consult buffer other window" "w ," #'consult-buffer-other-window
        :desc "dired jump" ">" #'dired-jump
        :desc "find-file other window" "w ." #'find-file-other-window
        :desc "format buffer" "b f" #'+format/buffer
        :desc "toggle format-all" "t f" #'format-all-mode
        :desc "bookmark list" "b w" #'list-bookmarks
        :desc "bookmark jump other window" "b o" #'bookmark-jump-other-window)
#+end_src

设置evil搜索时粘贴的快捷键
#+begin_src emacs-lisp
  (map! :map evil-ex-search-keymap
        "C-v" #'yank
        "C-q" #'quoted-insert)
#+end_src

设置vertico中Ctrl-Enter和Enter的功能一致。经常会不小心按错
#+begin_src emacs-lisp
  (map! :map vertico-map :g "C-<return>" #'exit-minibuffer)
#+end_src

以及文件管理相关的键位
#+begin_src emacs-lisp
  (map! :leader
        (:prefix ("v" . "my personal bindings")
         :desc "Open dirvish" "v" #'dirvish
         :desc "Open Normal Dired" "n" #'dired-jump
         :desc "Quit dirvish" "q" #'dirvish-quit
         :desc "Toggle dirvish-side" "s" #'dirvish-side
         :desc "Fd in dirvish" "F" #'dirvish-fd
         :desc "Jump using fd" "J" #'dirvish-fd-jump
         :desc "Jump recent dir" "j" #'consult-dir
         :desc "Fd find file in dir" "f" #'+vertico/consult-fd
         :desc "find Item in the buffer" "i" #'consult-imenu
         :desc "open with other coding system" "c" #'revert-buffer-with-coding-system
         :desc "change buffer coding system" "C" #'set-buffer-file-coding-system
         :desc "List processes" "l" #'list-processes
         :desc "toggle eldoc buffer" "h" #'eldoc
         :desc "VC Refresh state" "r" #'vc-refresh-state))
#+end_src

并且取消doom设置的一些我用不到的键位
#+begin_src emacs-lisp
  (map! :leader
        "i e" nil
        "f c" nil
        "n d" nil
        "f e" nil
        "f E" nil
        "f p" nil
        "f P" nil
        "s e" nil
        "s t" nil
        "h g" nil)
#+end_src

** evil-cmd
设置:q命令只关闭buffer，不关闭emacs，关闭时，输入:quit
#+begin_src emacs-lisp
  (evil-ex-define-cmd "q" 'kill-this-buffer)
  (evil-ex-define-cmd "Q" 'kill-this-buffer)
  (evil-ex-define-cmd "quit" 'evil-quit)
  (evil-ex-define-cmd "W" 'save-buffer)
#+end_src

* 基础插件
** undo
默认的undo行为在我看来不能适应。
好在emacs28后有了undo-only和undo-redo。
显示指定一下evil的undo。
#+begin_src emacs-lisp
  (setq undo-no-redo t)
  (setq evil-want-fine-undo t)
  (setq evil-undo-system 'undo-redo
        evil-undo-function 'undo-only
        evil-redo-function 'undo-redo)

  (setq undo-limit 400000           ; 400kb (default is 160kb)
        undo-strong-limit 3000000   ; 3mb   (default is 240kb)
        undo-outer-limit 48000000)  ; 48mb  (default is 24mb)
#+end_src

启动undo-fu-session
doom配置里，undo-fu-session在undo-fu之后启动。但我不需要undo-fu。
添加一个hook直接启动。
#+begin_src emacs-lisp
  (add-hook! 'doom-first-buffer-hook #'global-undo-fu-session-mode)
#+end_src

** projectile
修改projectile查找project-root的方式
先从上到下，后从下到上。
#+begin_src emacs-lisp
  (use-package! projectile
    :commands (project-projectile))

  (after! projectile
    (add-to-list 'projectile-project-root-files "go.mod")
    (setq projectile-project-root-functions '(projectile-root-local
                                              projectile-root-marked
                                              projectile-root-top-down
                                              projectile-root-bottom-up
                                              projectile-root-top-down-recurring)))

  (setq project-find-functions '(project-projectile project-try-vc))
#+end_src

** recentf
设置recentf最大储存项
doom默认的200个也太少了，至少1000吧
#+begin_src emacs-lisp
  (after! recentf
    (setq recentf-max-saved-items 1000))
#+end_src

** magit
设置clone的默认文件夹
#+begin_src emacs-lisp
  (setq magit-clone-default-directory "~/Codes/Lab/")
#+end_src

** recenter
设置各种跳转后居中
#+begin_src emacs-lisp
  (add-hook! 'better-jumper-post-jump-hook #'recenter)

  (defun recenter-advice (&rest args)
    (if (> (- (point-max) (point)) 2)
        (recenter)))

  (advice-add #'find-file :after #'recenter-advice)
  (advice-add #'evil-goto-line :after #'recenter-advice)
  (advice-add #'org-roam-node-find :after #'recenter-advice)
#+end_src

