.doom.d/config.el
(setq user-full-name "Jie Samb"
      user-mail-address "samb233@hotmail.com")

(setq-default buffer-file-coding-system 'utf-8-unix)
(set-default-coding-systems 'utf-8-unix)
(prefer-coding-system 'utf-8-unix)

(pushnew! default-frame-alist '(width . 80) '(height . 50))
(add-to-list 'default-frame-alist '(fullscreen . maximized))

;; (add-to-list 'default-frame-alist '(alpha-background . 95))
;; (add-to-list 'default-frame-alist (cons 'alpha 90))

(setq frame-title-format
      '((:eval (if (buffer-file-name)
                   (concat (format "emacs@%s: " (system-name))
                           (abbreviate-file-name (buffer-file-name))
                           (if (buffer-modified-p) "*"))
                 (format "emacs@%s" (system-name))))))

(remove-hook! 'doom-after-init-hook #'doom-display-benchmark-h)

(setq auth-source-save-behavior nil)

(setq uniquify-buffer-name-style 'forward)

(setq native-comp-speed -1)
(setq native-comp-jit-compilation nil)

(setq doom-font (font-spec :family "BlexMono Nerd Font" :weight 'medium :size 11.0))
(setq doom-unicode-font (font-spec :family "BlexMono Nerd Font"))
(setq doom-variable-pitch-font (font-spec :family "霞鹜文楷"))

(defun my-cjk-font()
  (set-fontset-font t 'unicode (font-spec :family "Noto Color Emoji") nil 'prepend)
  (dolist (charset '(kana han cjk-misc symbol bopomofo))
    (set-fontset-font t charset (font-spec :family "Sarasa Mono SC") nil)
    (set-fontset-font t charset (font-spec :family "霞鹜文楷") nil 'append)))

(add-hook 'after-setting-font-hook #'my-cjk-font)

(setq doom-theme 'doom-tomorrow-day)

;; (custom-set-faces
;;  '(line-number ((t (:weight medium :slant unspecified))))
;;  '(line-number-current-line ((t (:weight medium :slant unspecified)))))

(setq all-the-icons-scale-factor 1.2)

(after! doom-modeline
  (setq doom-modeline-modal nil
        doom-modeline-icon nil
        doom-modeline-lsp nil
        doom-modeline-buffer-state-icon nil
        doom-modeline-buffer-modification-icon nil
        doom-modeline-buffer-encoding t
        doom-modeline-vcs-max-length 20
        doom-modeline-height 29
        doom-modeline-window-width-limit 120)
  ;;(set-face-attribute 'mode-line-active nil :background "#f4f4f4")
  )

(after! solaire-mode
 (dolist (face '(mode-line mode-line-inactive))
    (setf (alist-get face solaire-mode-remap-alist) nil)))

(setq word-wrap-by-category t)

(setq mouse-wheel-progressive-speed nil
      scroll-preserve-screen-position nil)
(setq mouse-wheel-scroll-amount
      '(3
        ((shift) . hscroll)
        ((meta))
        ((control) . text-scale)))

;; (pixel-scroll-precision-mode t)

(map! :n "<mouse-8>" #'better-jumper-jump-backward
      :n "<mouse-9>" #'better-jumper-jump-forward)

(map! :i  "C-v"   #'yank
      :i  "M-v"   #'yank
      :v  "J"     #'drag-stuff-down
      :v  "K"     #'drag-stuff-up
      :ni "C-s"   #'consult-line
      :ni "C-z"   #'undo-only
      :ni "C-S-z" #'undo-redo
      :nv "g r"   #'+lookup/references
      :n  "q"     #'doom/escape
      :n  "U"     #'evil-redo
      :n  "g a"   #'avy-goto-char-2
      :n  "] e"   #'flymake-goto-next-error
      :n  "[ e"   #'flymake-goto-prev-error
      :n  "] w"   #'evil-window-right
      :n  "[ w"   #'evil-window-left
      :n  "[ W"   #'evil-window-down
      :n  "] W"   #'evil-window-up
      :leader
      :desc "jump to references" "c r" #'+lookup/references
      :desc "consult buffer" "<" #'consult-buffer
      :desc "consult buffer other window" "w ," #'consult-buffer-other-window
      :desc "dired jump" ">" #'dired-jump
      :desc "find-file other window" "w ." #'find-file-other-window
      :desc "format buffer" "b f" #'+format/buffer
      :desc "toggle format-all" "t f" #'format-all-mode
      :desc "bookmark list" "b w" #'list-bookmarks
      :desc "bookmark jump other window" "b o" #'bookmark-jump-other-window)

(map! :map evil-ex-search-keymap
      "C-v" #'yank
      "C-q" #'quoted-insert)

(map! :map vertico-map :g "C-<return>" #'exit-minibuffer)

(map! :leader
      (:prefix ("v" . "my personal bindings")
       :desc "Open dirvish" "v" #'dirvish
       :desc "Open Normal Dired" "n" #'dired-jump
       :desc "Quit dirvish" "q" #'dirvish-quit
       :desc "Toggle dirvish-side" "s" #'dirvish-side
       :desc "Fd in dirvish" "F" #'dirvish-fd
       :desc "Jump using fd" "J" #'dirvish-fd-jump
       :desc "Jump recent dir" "j" #'consult-dir
       :desc "Fd find file in dir" "f" #'+vertico/consult-fd
       :desc "find Item in the buffer" "i" #'consult-imenu
       :desc "open with other coding system" "c" #'revert-buffer-with-coding-system
       :desc "change buffer coding system" "C" #'set-buffer-file-coding-system
       :desc "List processes" "l" #'list-processes
       :desc "toggle eldoc buffer" "h" #'eldoc
       :desc "VC Refresh state" "r" #'vc-refresh-state))

(map! :leader
      "i e" nil
      "f c" nil
      "n d" nil
      "f e" nil
      "f E" nil
      "f p" nil
      "f P" nil
      "s e" nil
      "s t" nil
      "h g" nil)

(evil-ex-define-cmd "q" 'kill-this-buffer)
(evil-ex-define-cmd "Q" 'kill-this-buffer)
(evil-ex-define-cmd "quit" 'evil-quit)
(evil-ex-define-cmd "W" 'save-buffer)

(setq undo-no-redo t)
(setq evil-want-fine-undo t)
(setq evil-undo-system 'undo-redo
      evil-undo-function 'undo-only
      evil-redo-function 'undo-redo)

(setq undo-limit 400000           ; 400kb (default is 160kb)
      undo-strong-limit 3000000   ; 3mb   (default is 240kb)
      undo-outer-limit 48000000)  ; 48mb  (default is 24mb)

(add-hook! 'doom-first-buffer-hook #'global-undo-fu-session-mode)

(use-package! projectile
  :commands (project-projectile))

(after! projectile
  (add-to-list 'projectile-project-root-files "go.mod")
  (setq projectile-project-root-functions '(projectile-root-local
                                            projectile-root-marked
                                            projectile-root-top-down
                                            projectile-root-bottom-up
                                            projectile-root-top-down-recurring)))

(setq project-find-functions '(project-projectile project-try-vc))

(after! recentf
  (setq recentf-max-saved-items 1000))

(setq magit-clone-default-directory "~/Codes/Lab/")

(add-hook! 'better-jumper-post-jump-hook #'recenter)

(defun recenter-advice (&rest args)
  (if (> (- (point-max) (point)) 2)
      (recenter)))

(advice-add #'find-file :after #'recenter-advice)
(advice-add #'evil-goto-line :after #'recenter-advice)
(advice-add #'org-roam-node-find :after #'recenter-advice)
