.doom.d/config.org
** evil-mc
使用evil-mc推荐的键位，简化进入多行编辑的按键
#+begin_src emacs-lisp
  (evil-define-key 'visual 'global
    "A" #'evil-mc-make-cursor-in-visual-selection-end
    "I" #'evil-mc-make-cursor-in-visual-selection-beg
    "N" #'+multiple-cursors/evil-mc-toggle-cursor-here)

  (evil-define-key 'normal 'evil-mc-key-map
    "Q" #'evil-mc-undo-all-cursors)
#+end_src

** lookup
与在新窗口查看定义和引用
#+begin_src emacs-lisp
  (use-package! doom-lookup-other-window
    :config
    (map! :nv "g D" #'+lookup/definition-other-window
          :nv "g R" #'+lookup/references-other-window
          :leader
          :desc "jump to reference other window" "c R" #'+lookup/references-other-window
          :desc "jump to definition other window" "c D" #'+lookup/definition-other-window))
#+end_src

** ediff
设置退出时不询问。并且打开时立刻跳转到第一个修改。
#+begin_src emacs-lisp
  (defun disable-y-or-n-p (orig-fun &rest args)
    (cl-letf (((symbol-function 'y-or-n-p) (lambda (prompt) t)))
      (apply orig-fun args)))
  (advice-add 'ediff-quit :around #'disable-y-or-n-p)

  (add-hook! 'ediff-startup-hook #'ediff-next-difference)
#+end_src

** pixel-scroll
设置在打开org和markdown的inline-image时自动开启像素滚动模式。
#+begin_src emacs-lisp
  (use-package! pixel-scroll)

  (defun my-inline-image-pixel-scroll()
    (setq-local evil-move-beyond-eol t
                pixel-scroll-precision-mode t))

  (defun my-disable-inline-image-pixel-scroll()
    (setq-local evil-move-beyond-eol nil
                pixel-scroll-precision-mode nil))

  (after! markdown-mode
  (advice-add 'markdown-display-inline-images :after #'my-inline-image-pixel-scroll)
  (advice-add 'markdown-remove-inline-images :after #'my-disable-inline-image-pixel-scroll))

  (after! org
  (advice-add 'org-display-inline-images :after #'my-inline-image-pixel-scroll)
  (advice-add 'org-remove-inline-images :after #'my-disable-inline-image-pixel-scroll))
#+end_src

* 代码补全
我使用eglot+corfu的组合。尽量多的利用emacs已经合并的插件。
** eglot
#+begin_src emacs-lisp
  (after! eglot
    (setq eglot-events-buffer-size 0)
    (setq eglot-stay-out-of '(yasnippet))
    (setq eglot-ignored-server-capabilities '(:inlayHintProvider))
    (map! :map eglot-mode-map
          :nv "g D" nil
          :leader
          :desc "LSP start/restart" "c l" #'eglot
          :desc "LSP reconnect" "c L" #'eglot-reconnect
          :desc "LSP rename" "c n" #'eglot-rename)
    (set-popup-rule! "^\\*eglot-help" :size 0.3 :quit t :select nil)
    (set-face-attribute 'eglot-highlight-symbol-face nil :background "#d6d4d4"))
#+end_src

modeline设置，不在modeline上显示eglot任何信息
#+begin_src emacs-lisp
  (defun my-remove-eglot-mode-line()
    "Remove `eglot' from mode-line"
    (setq mode-line-misc-info
              (delq (assq 'eglot--managed-mode mode-line-misc-info) mode-line-misc-info)))
  (add-hook 'eglot-managed-mode-hook #'my-remove-eglot-mode-line)
#+end_src

** corfu
#+begin_src emacs-lisp
  (after! corfu-popupinfo
    (setq corfu-popupinfo-delay nil))

  (setq +corfu-auto-delay 0.02)
  (after! corfu
    (setq corfu-preselect 'prompt
          corfu-on-exact-match nil
          corfu-popupinfo-max-height 20
          corfu-count 10)
    (map! :map corfu-map
          :i "C-j" #'corfu-next
          :i "C-k" #'corfu-previous
          :i "C-i" #'corfu-insert-separator
          :i "C-s" #'corfu-insert-separator
          :i "C-h" #'corfu-info-documentation
          :i "C-l" #'corfu-complete
          :i "C-g" #'corfu-quit)
    (map! :i "C-S-p" #'cape-file)
    (add-hook! 'evil-insert-state-exit-hook #'corfu-quit)
    (set-face-attribute 'corfu-current nil :background "#cde1f8")
    (use-package! kind-all-the-icons)
    (add-to-list 'corfu-margin-formatters #'kind-all-the-icons-margin-formatter))
#+end_src

** flymake
flymake和eglot一起用时就不用设置什么了
#+begin_src emacs-lisp
  (use-package! flymake
    :commands (flymake-mode)
    :hook ((prog-mode text-mode conf-mode) . flymake-mode)
    :config
    (setq flymake-fringe-indicator-position 'right-fringe)
    (set-popup-rule! "^\\*format-all-errors*" :size 0.15 :select nil :modeline nil :quit t)
    (set-popup-rule! "^\\*Flymake diagnostics" :size 0.2 :modeline nil :quit t :select nil))
#+end_src

更改flymake指示的bitmap样式
#+begin_src emacs-lisp
  (use-package! flymake-triangle-bitmap
    :after flymake
    :config
    (setq flymake-note-bitmap    '(my-small-left-triangle compilation-info)
          flymake-error-bitmap   '(my-small-left-triangle compilation-error)
          flymake-warning-bitmap '(my-small-left-triangle compilation-warning)))
#+end_src

** eldoc
设置eldoc buffer为popup
也可以配置flymake约eldoc同时显示，见[[https://github.com/joaotavora/eglot/issues/1171][issue]]， 但我不喜欢这种形式
#+begin_src emacs-lisp
  (after! eldoc
    (setq eldoc-echo-area-display-truncation-message nil
          eldoc-echo-area-use-multiline-p nil
          eldoc-echo-area-prefer-doc-buffer t)
    (set-popup-rule! "^\\*eldoc*" :size 0.15 :modeline nil :quit t))
  #+end_src

** yasnippet
兼容yas和corfu的tab
#+begin_src emacs-lisp
  (defun my-corfu-frame-visible-h ()
    (and (frame-live-p corfu--frame) (frame-visible-p corfu--frame)))
  (add-hook 'yas-keymap-disable-hook #'my-corfu-frame-visible-h)
#+end_src

** dabbrev
dabbrev是emacs的一个补全后端，设置它只补全ascii英文，而不去补全中文。
因为中文没有空格等分隔开，一补全就是一句，没有意义。
#+begin_src emacs-lisp
  (use-package dabbrev
    :config
    (setq dabbrev-abbrev-char-regexp "[A-Za-z-_]"))
#+end_src

* 文件管理
** dired
由于我取消勾选了doom的dired模块，所以需要自己设置一些dired的选项。
#+begin_src emacs-lisp
  (use-package! dired
    :commands dired-jump
    :hook
    (dired-mode . dired-omit-mode)
    (dired-mode . dired-async-mode)
    :init
    (setq dired-dwim-target t
          dired-hide-details-hide-symlink-targets nil
          dired-recursive-copies  'always
          dired-recursive-deletes 'always
          dired-create-destination-dirs 'ask
          dired-clean-confirm-killing-deleted-buffers nil)
    :config
    (setq dired-async-skip-fast t)
    (setq dired-omit-files
          (concat "\\`[.][.]?\\'"
                  "\\|^\\.DS_Store\\'"
                  "\\|^\\.project\\(?:ile\\)?\\'"
                  "\\|^\\.\\(?:svn\\|git\\)\\'"
                  "\\|^\\.ccls-cache\\'"
                  "\\|\\(?:\\.js\\)?\\.meta\\'"
                  "\\|\\.\\(?:elc\\|o\\|pyo\\|swp\\|class\\)\\'"))
    (map! :map dired-mode-map
          :ng "q" #'quit-window )
    (custom-set-faces '(dired-async-message ((t (:inherit success))))))
#+end_src

