.doom.d/config.org
** dirvish
Dirvish真是接近完美的文件管理器。除了鼠标操作比较难受外，处处让我感到满足。
#+begin_src emacs-lisp
  (use-package! dirvish
    :init (after! dired (dirvish-override-dired-mode))
    :custom
    (dirvish-quick-access-entries
     '(("h" "~/"                          "Home")
       ("c" "~/Codes/"                    "Codes")
       ("D" "~/Documents/"                "Documents")
       ("w" "~/Works/"                    "Works")
       ("d" "~/Downloads/"                "Downloads")
       ("P" "~/Pictures/"                 "Pictures")
       ("v" "~/Videos/"                   "Videos")
       ("s" "~/Share/"                    "Shared")
       ("n" "~/Notes/"                    "Notes")
       ("b" "~/Books/"                    "Books")
       ("M" "/mnt/"                       "Drives")))
    :config
    (dirvish-side-follow-mode 1)
    (add-to-list 'dirvish-video-exts "m2ts")
    (setq dirvish-side-width 40
          dirvish-side-auto-close t
          dirvish-side-display-alist `((side . right) (slot . -1)))
    (setq dirvish-emerge-groups
          '(("24h" (predicate . recent-files-today))
            ("文档" (extensions "pdf" "epub" "doc" "docx" "xls" "xlsx" "ppt" "pptx"))
            ("视频" (extensions "mp4" "mkv" "webm"))
            ("图片" (extensions "jpg" "png" "svg" "gif"))
            ("音频" (extensions "mp3" "flac" "wav" "ape" "m4a" "ogg"))
            ("压缩包" (extensions "gz" "rar" "zip" "7z" "tar" "z"))))
    (setq dirvish-default-layout '(0 0 0.5)
          dirvish-use-mode-line nil
          dirvish-header-line-height '41
          dirvish-path-separators (list "  ~" "   " "/")
          dirvish-subtree-file-viewer #'dired-find-file
          dirvish-header-line-format
          '(:left (path) :right (yank sort index " "))
          dirvish-attributes
          '(file-time all-the-icons file-size collapse subtree-state vc-state git-msg)
          dired-listing-switches
          "-l --almost-all --human-readable --group-directories-first --no-group --time-style=iso"
          dirvish-open-with-programs
          `((,dirvish-audio-exts . ("mpv" "%f"))
            (,dirvish-video-exts . ("mpv" "%f"))
            (,dirvish-image-exts . ("eog" "%f"))
            (("doc" "docx") . ("wps" "%f"))
            (("ppt" "pptx") . ("wpp" "%f"))
            (("xls" "xlsx") . ("et" "%f"))
            (("pdf") . ("evince" "%f"))
            (("odt" "ods" "rtf" "odp") . ("libreoffice" "%f"))
            (("epub") . ("koodo-reader" "%f"))))
    (map! :map dirvish-mode-map
          :n "h" #'dired-up-directory
          :n "l" #'dired-find-file
          :n "e" #'dired-create-empty-file
          :n "." #'dired-omit-mode
          :n "C-." #'dirvish-emerge-mode
          :n "q" #'dirvish-quit
          :n "s" #'dirvish-quicksort
          :n "a" #'dirvish-quick-access
          :n "F" #'dirvish-fd
          :n "S" #'dirvish-fd-switches-menu
          :n "y" #'dirvish-yank-menu
          :n "f" #'dirvish-file-info-menu
          :n "H" #'dirvish-history-jump
          :n "TAB" #'dirvish-subtree-toggle
          :n [backtab] #'dirvish-subtree-up
          :n "<mouse-1>" #'dirvish-subtree-toggle
          :n "<mouse-2>" #'dirvish-subtree-toggle
          :n "<mouse-3>" #'dired-find-file
          :n "<mouse-8>" #'dired-up-directory
          :n "<mouse-9>" #'dired-find-file
          :n "<double-mouse-1>" #'dired-find-file
          :n "<double-mouse-3>" #'dired-up-directory
          "M-t" #'dirvish-layout-toggle
          "M-j" #'dirvish-fd-jump
          "M-m" #'dirvish-mark-menu))
#+end_src

设置方便的快捷键
#+begin_src emacs-lisp
  (map! [f8]     #'dired-jump
        [S-f8]   #'dirvish)
#+end_src

** nautilus
#+begin_src emacs-lisp
  (defun my-open-nautilus()
    (interactive)
    (call-process-shell-command "nautilus ." nil 0))

  (map! [f9] #'my-open-nautilus
        :map vterm-mode-map [f9] #'my-open-nautilus)
#+end_src

* 终端
使用性能更好的vterm
#+begin_src emacs-lisp
  (setq vterm-always-compile-module t)
  (setq vterm-buffer-name-string "*vterm: %s*")
  (after! vterm
    (setq vterm-timer-delay    0.02
          vterm-max-scrollback 20000)
    (advice-add #'vterm--redraw :after (lambda (&rest args) (evil-refresh-cursor evil-state)))
    (set-face-attribute 'vterm-color-black nil :background "#a7a7a7"))
#+end_src

vterm与doom的适配
禁用+popup-adjust-fringes-h和+popup-margin-width
来让vterm不在打开时长度超过一行而导致鬼畜换行
目前还不知道有什么副作用
#+begin_src emacs-lisp
  (setq +popup-margin-width nil)
  (add-hook! 'doom-first-buffer-hook
    (remove-hook '+popup-buffer-mode-hook #'+popup-adjust-fringes-h))

  (add-hook! 'vterm-mode-hook (setq-local kill-buffer-query-functions nil))
#+end_src

使用自定义的vterm-toggle。
#+begin_src emacs-lisp
  (use-package! doom-vterm-toggle
    :commands (doom-vterm-toggle-directory
               doom-vterm-toggle-project))

  (map! :map vterm-mode-map [f4] nil)
  (map! [f4] #'doom-vterm-toggle-project
        [C-f4] #'doom-vterm-toggle-directory
        [S-f4] #'+vterm/here
        :leader
        "o t" #'doom-vterm-toggle-project)
#+end_src

* Org-Mode
** 基本外观
配置一下Org-Mode的主题颜色、字体大小等。
最后一行用于设置org-mode的代码块，使其能有代码缩进，更好看些。
另外做个备忘，org-mode中提升标题等级是M+左箭头，降低是M+右箭头。
#+begin_src emacs-lisp
  (setq org-directory "~/Notes")
  (custom-set-faces
   '(org-level-1 ((t (:height 1.3 :foreground "#4271ae" :weight ultra-bold))))
   '(org-level-2 ((t (:height 1.2 :foreground "#8959a8" :weight extra-bold))))
   '(org-level-3 ((t (:height 1.1 :foreground "#718c00" :weight bold))))
   '(org-level-4 ((t (:height 1.0 :foreground "#eab700" :weight semi-bold))))
   '(org-level-5 ((t (:height 1.0 :foreground "#c82829" :weight normal))))
   '(org-level-6 ((t (:height 1.0 :foreground "#70c0ba" :weight normal))))
   '(org-level-7 ((t (:height 1.0 :foreground "#b77ee0" :weight normal))))
   '(org-level-8 ((t (:height 1.0 :foreground "#9ec400" :weight normal)))))

  (after! org
    (setq org-src-preserve-indentation nil
          org-image-actual-width 640
          org-hide-emphasis-markers t
          org-support-shift-select t)
    (map! :map org-mode-map
          :localleader "-" #'org-emphasize))
#+end_src

** org-evil
doom为org-mode设计了一些用不上的快捷键。
尤其是insert模式时，C-l、C-h的键位都被改了，我不能接受。
#+begin_src emacs-lisp
  (after! evil-org
    (map! :map evil-org-mode-map
          :i "C-l" nil
          :i "C-h" nil
          :i "C-j" nil
          :i "C-k" nil))
#+end_src

** org-modern
#+begin_src emacs-lisp
  (use-package! org-modern
    :commands (org-modern-mode)
    :config
    (setq org-modern-block-name nil
          org-modern-table nil)
    (setq org-modern-star '("◉" "○" "✸" "✿" "◈" "◇"))
    (set-face-attribute 'org-modern-label nil :height 1.0))

  (add-hook 'org-mode-hook #'org-modern-mode)
#+end_src

** org-appear
#+begin_src emacs-lisp
  (use-package! org-appear
    :commands (org-appear-mode)
    :init
    (setq org-appear-autolinks t))

  (add-hook 'org-mode-hook #'org-appear-mode)
#+end_src

** org-roam
设置笔记文件夹
#+begin_src emacs-lisp
  (setq org-roam-directory "~/Notes/Roam")
  (map! :leader
        :desc "Zettelkasten with org-roam" "v z" #'org-roam-node-find
        :desc "org-roam node Insert" "v i" #'org-roam-node-insert)
#+end_src

禁用补全
#+begin_src emacs-lisp
  (after! org-roam
    (setq org-roam-completion-everywhere nil))
#+end_src

日志模板。
主要是使用模板设置保存的文件夹，来兼容我以前的日志模式。
我希望我创建日志的时候能一键弹出，而不用选择模板什么的，所以只设置一个模板。
#+begin_src emacs-lisp
  (setq org-roam-dailies-directory "~/Notes/Daily")
  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %?"
           :target (file+head "%<%Y>/%<%Y-%m>/%<%Y-%m-%d>.org"
                              "#+title: %<%Y-%m-%d %A>\n"))))
  (map! :leader
        :desc "my Journal today" "J" #'org-roam-dailies-goto-today
        :desc "org-roam find node" "Z" #'org-roam-node-find)
#+end_src

设置模板
同样，也是通过模板来设置保存的文件夹。
org-roam默认将文件堆在一个文件夹下我是不太喜欢的。
#+begin_src emacs-lisp
  (setq org-roam-capture-templates '(
            ("d" "Default" plain "%?"
            :target (file+head "Default/%<%Y%m%d%H%M%S>-${slug}.org"
                                "#+title: ${title}\n#+filetags: \n\n")
            :unnarrowed t)
            ("l" "Learn" plain "%?"
            :target (file+head "Learn/%<%Y%m%d%H%M%S>-${slug}.org"
                                "#+title: ${title}\n#+filetags: :learn: \n\n")
            :unarrowed t)
            ("t" "Think" plain "%?"
            :target (file+head "Think/%<%Y%m%d%H%M%S>-${slug}.org"
                                "#+title: ${title}\n#+filetags: :think: \n\n")
            :unnarrowed t)
            ("c" "Create" plain "%?"
            :target (file+head "Create/%<%Y%m%d%H%M%S>-${slug}.org"
                                "#+title: ${title}\n#+filetags: :create: \n\n")
            :unnarrowed t)))
#+end_src

