.doom.d/config.org
** org-agenda
也尝试使用一下agenda管理日程。
首先就是将窗口改成popup。
#+begin_src emacs-lisp
  (map! :leader "A" (lambda () (interactive) (org-agenda nil "n")))

  (after! org-agenda
    (set-popup-rule! "^\\*Org Agenda" :side 'right :size 0.25 :quit t :select t :modeline nil))
#+end_src

* 语言mode
** markdown-mode
也是设置一下字体大小和颜色。
在emacs下我也很少写markdown了。
#+begin_src emacs-lisp
  (custom-set-faces
   '(markdown-code-face ((t (:background "#f5f5f5"))))
   '(markdown-header-delimiter-face ((t (:foreground "#616161" :height 0.9))))
   '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.3 :foreground "#4271ae" :weight ultra-bold))))
   '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.2 :foreground "#8959a8" :weight extra-bold))))
   '(markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.1 :foreground "#718c00" :weight bold))))
   '(markdown-header-face-4 ((t (:inherit markdown-header-face :height 1.0 :foreground "#eab700" :weight semi-bold))))
   '(markdown-header-face-5 ((t (:inherit markdown-header-face :height 1.0 :foreground "#c82829" :weight normal))))
   '(markdown-header-face-6 ((t (:inherit markdown-header-face :height 1.0 :foreground "#70c0ba" :weight normal))))
   '(markdown-header-face-7 ((t (:inherit markdown-header-face :height 1.0 :foreground "#b77ee0" :weight normal)))))

  (add-hook! 'markdown-mode-hook (setq-local markdown-fontify-code-blocks-natively t))
  (after! markdown-mode
    (setq markdown-fontify-whole-heading-line nil)
    (setq markdown-fontify-code-blocks-natively t)
    (setq markdown-max-image-size '(640 . 480))
    (map! :map markdown-mode-map :n "z i" #'markdown-toggle-inline-images)
    (set-popup-rule! "^\\*edit-indirect" :size 0.42 :quit nil :select t :autosave t :modeline t :ttl nil))
#+end_src

** go-mode
开启lsp的自动import和format。
因为在开启lsp的情况下，go-mode的这部分功能被关闭了，全部交给了gopls。
#+begin_src emacs-lisp
  (defun my-eglot-organize-imports ()
    (ignore-errors(call-interactively 'eglot-code-action-organize-imports)))
  (defun my-go-mode-init ()
    (add-hook 'before-save-hook #'eglot-format-buffer -10 t)
    (add-hook 'before-save-hook #'my-eglot-organize-imports nil t))
  (add-hook 'go-mode-hook #'my-go-mode-init)
#+end_src

禁用没用的快捷键，以免按错
#+begin_src emacs-lisp
  (after! go-mode
    (map! :map go-mode-map
          :localleader
          "h" nil
          "e" nil
          "i" nil
          (:prefix ("i" . "imports")
                   "i" #'go-goto-imports
                   "a" #'go-import-add
                   "r" #'go-remove-unused-imports)))
#+end_src

** protobuf-mode
#+begin_src emacs-lisp
  (use-package protobuf-mode
    :commands (protobuf-mode)
    :mode("\\.proto\\'" . protobuf-mode))
#+end_src

** dockerfile-mode
#+begin_src emacs-lisp
  (use-package dockerfile-mode
    :commands (dockerfile-mode)
    :mode("\\Dockerfile\\'" . dockerfile-mode))
#+end_src

** shell
设置shell的formatter
我已经忘了我为什么要设置这个。
似乎是不设置会报错。
#+begin_src emacs-lisp
  (after! sh-script
    (set-formatter! 'shfmt
      '("shfmt" "-ci"
        ("-i" "%d" (unless indent-tabs-mode tab-width))
        ("-ln" "%s" (pcase sh-shell (`bash "bash") (`zsh "bash") (`mksh "mksh") (_ "posix"))))))
#+end_src

** python
设置在org和markdown的代码块中，"py"打开python-mode
自己用还是尽量写全python，主要是为了阅读其他人写的"py"代码块
#+begin_src emacs-lisp
  (after! org
    (add-to-list 'org-src-lang-modes '("py" . python-mode)))

  (after! markdown-mode
    (add-to-list 'markdown-code-lang-modes '("py" . python-mode)))
#+end_src

** vapoursynth
设置用python-mode打开vpy文件
#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.vpy\\'" . python-mode))
#+end_src

设置vspreview，vsbench等命令
#+begin_src emacs-lisp
  (defun vspreview()
    "Vapoursynth preview this script."
    (interactive)
    (async-shell-command
     (format "~/vscp/bin/python -m vspreview %s" buffer-file-name)
     "*vspreview*"))

  (defun vsbench()
    "Vapoursynth bench this script."
    (interactive)
    (async-shell-command
     (format "~/vscp/bin/vspipe -p %s ." buffer-file-name)
     "*vsbench*"))

  (map! :map python-mode-map
          :localleader
          "p" #'vspreview
          "b" #'vsbench)
#+end_src

设置窗口popup
#+begin_src emacs-lisp
  (set-popup-rule! "^\\*vspreview*" :size 0.2 :quit t :select nil)
  (set-popup-rule! "^\\*vsbench*" :size 0.2 :quit t :select nil)
#+end_src

** lua
#+begin_src emacs-lisp
  (after! lua-mode
    (setq +lua-lsp-dir "/usr/lib/lua-language-server/"))
#+end_src

** image
使用快捷键打开系统图片浏览器。依赖dirvish。
#+begin_src emacs-lisp
  (defun my-open-current-file-with-app()
    (interactive)
    (progn
      (dirvish-find-entry-a buffer-file-name)
      (quit-window)))

  (map! :map image-mode-map
        :ng "W" #'my-open-current-file-with-app
        "<double-mouse-1>" #'my-open-current-file-with-app)
#+end_src

* 工具包
** 输入法切换
使用sis实现中英文输入法自动切换。
#+begin_src emacs-lisp
  (use-package! sis
    :config
    (sis-ism-lazyman-config "1" "2" 'fcitx5)
    (sis-global-respect-mode t)
    (sis-global-context-mode t))
#+end_src

** evil-pinyin
用首字母搜索拼音
#+begin_src emacs-lisp
  (use-package! evil-pinyin
    :when (modulep! :editor evil +everywhere)
    :after evil
    :config
    (setq-default evil-pinyin-with-search-rule 'always)
    (global-evil-pinyin-mode 1))
#+end_src

** tabspaces
加强tabbar，管理工作区内buffer
#+begin_src emacs-lisp
  (use-package! tabspaces
    :hook (doom-init-ui . tabspaces-mode)
    :commands (tabspaces-switch-or-create-workspace
               tabspaces-close-workspace)
    :init
    (setq tab-bar-show nil)
    (tab-rename "Default")
    :custom
    (tabspaces-use-filtered-buffers-as-default t)
    (tabspaces-default-tab "Default")
    (tabspaces-remove-to-default t)
    (tabspaces-include-buffers '("*scratch*"))
    (tabspaces-session nil)
    (tabspaces-session-auto-restore nil)
    :config
    (map! :leader
          :desc "switch or create tab" "TAB" #'tab-bar-switch-to-tab
          :desc "close current tab" [backtab] #'tab-bar-close-tab))
#+end_src

设置addvice，让新建tab时只剩一个scratch buffer
#+begin_src emacs-lisp
  (defun tabspaces-reset-advice()
    (switch-to-buffer "*scratch*"))

  (advice-add #'tabspaces-reset-buffer-list :before #'tabspaces-reset-advice)
#+end_src

** tab-bookmark
#+begin_src emacs-lisp
  (use-package! tab-bookmark
    :commands (tab-bookmark
               tab-bookmark-handler))

  (map! :leader
        :desc "Bookmark Tab" "b TAB" #'tab-bookmark)
#+end_src

** 单词翻译
#+begin_src emacs-lisp
  (use-package! fanyi
    :commands (fanyi-dwim
               fanyi-dwim2)
    :custom
    (fanyi-providers '(;; 海词
                       fanyi-haici-provider
                       ;; 有道同义词词典
                       fanyi-youdao-thesaurus-provider
                       ;; Etymonline
                       ;; fanyi-etymon-provider
                       ;; Longman
                       ;; fanyi-longman-provider
                       )))

  (set-popup-rule! "^\\*fanyi*" :size 0.3 :modeline nil :quit t)
  (add-hook 'fanyi-mode-hook #'doom-disable-line-numbers-h)
  (map! :leader
        :desc "Translate word" "v t" #'fanyi-dwim2)
#+end_src

** restclient
配置restclient，使之与vscode的restclient兼容。
代码来源：[[https://github.com/yurifrl/restclient/blob/b025b6f87fb85a3e6471e475aca8ffb7005f6163/restclient.el#LL187C1-L201C1][restclient-vscode-compatible]]
#+begin_src emacs-lisp
  (after! restclient
    (setq restclient-use-var-regexp
          "{{\([^{ \n]+\)}}$")
    (setq restclient-var-regexp
          (concat "^\\(@[^@= ]+\\)[ \t]*\\(:?\\)=[ \t]*\\(<<[ \t]*\n\\(\\(.*\n\\)*?\\)" restclient-comment-separator "\\|\\([^<].*\\)$\\)"))
    (setq restclient-svar-regexp
          "^\\(@[^@= ]+\\)[ \t]*=[ \t]*\\(.+?\\)$")
    (setq restclient-evar-regexp
          "^\\(@[^@ ]+\\)[ \t]*:=[ \t]*\\(.+?\\)$")
    (setq restclient-mvar-regexp
          "^\\(@[^@ ]+\\)[ \t]*:?=[ \t]*\\(<<\\)[ \t]*$"))
#+end_src

** texfrag
用来在markdown-mode中查看latex公式
texfrag很好用，但是会在当前文件夹下生成额外的文件，且不能将他们移到cache文件夹。
需要寻找替代品
#+begin_src emacs-lisp
  (use-package! texfrag
    :commands (texfrag-mode)
    :init
    (setq texfrag-markdown-preview-image-links nil
          texfrag-scale 0.25
          texfrag-subdir ".texfrag"))

  (defun my-toggle-texfrag-preview-document()
    (interactive)
    (if (bound-and-true-p texfrag-mode)
        (texfrag-mode -1)
      (progn (texfrag-mode)
             (texfrag-document))))
  (map! :map markdown-mode-map :localleader
        :desc "latex preview math" "l" #'my-toggle-texfrag-preview-document)
#+end_src

