.doom.d/config.org
** writeroom
打开writeroom-mode时，做一系列操作，如打开pixel-scroll、关闭行号等
#+begin_src emacs-lisp
  (defun my-writeroom-mode-on()
    (if (equal major-mode 'org-mode)
        (org-display-inline-images))
    (if (member major-mode '(markdown-mode gfm-mode))
        (markdown-display-inline-images))
    (doom-disable-line-numbers-h))

  (defun my-writeroom-mode-off()
    (if (equal major-mode 'org-mode)
        (org-remove-inline-images))
    (if (member major-mode '(markdown-mode gfm-mode))
        (markdown-remove-inline-images))
    (doom-enable-line-numbers-h))

  (add-hook 'writeroom-mode-on-hook #'my-writeroom-mode-on)
  (add-hook 'writeroom-mode-off-hook #'my-writeroom-mode-off)
#+end_src

** org-tree-slide
懒得做ppt
#+begin_src emacs-lisp
  (setq +org-present-text-scale 3)
  (add-hook 'org-tree-slide-play-hook #'doom-disable-line-numbers-h)
  (add-hook 'org-tree-slide-stop-hook #'doom-enable-line-numbers-h)
#+end_src
